app/Models/Authentications/AuthModel.php

    public function LogIn($username){
        $query = $this->db->table('auth_user')->where('username',$username);
---
SELECT *
FROM `auth_user`
WHERE `username` = 'test'